MicrochipTech/oa-tc6-lib/examples/lwIP-SAM-D21-Curiosity-Nano/firmware/src/packs/ATSAMD21G17D_DFP/component/sysctrl.h
#define SYSCTRL_PCLKSR_XOSCRDY_Pos            _UINT32_(0)                                          /* (SYSCTRL_PCLKSR) XOSC Ready Position */
#define SYSCTRL_PCLKSR_XOSCRDY_Msk            (_UINT32_(0x1) << SYSCTRL_PCLKSR_XOSCRDY_Pos)        /* (SYSCTRL_PCLKSR) XOSC Ready Mask */
#define SYSCTRL_PCLKSR_XOSCRDY(value)         (SYSCTRL_PCLKSR_XOSCRDY_Msk & (_UINT32_(value) << SYSCTRL_PCLKSR_XOSCRDY_Pos)) /* Assigment of value for XOSCRDY in the SYSCTRL_PCLKSR register */
#define SYSCTRL_PCLKSR_XOSC32KRDY_Pos         _UINT32_(1)                                          /* (SYSCTRL_PCLKSR) XOSC32K Ready Position */
#define SYSCTRL_PCLKSR_XOSC32KRDY_Msk         (_UINT32_(0x1) << SYSCTRL_PCLKSR_XOSC32KRDY_Pos)     /* (SYSCTRL_PCLKSR) XOSC32K Ready Mask */
#define SYSCTRL_PCLKSR_XOSC32KRDY(value)      (SYSCTRL_PCLKSR_XOSC32KRDY_Msk & (_UINT32_(value) << SYSCTRL_PCLKSR_XOSC32KRDY_Pos)) /* Assigment of value for XOSC32KRDY in the SYSCTRL_PCLKSR register */
#define SYSCTRL_PCLKSR_OSC32KRDY_Pos          _UINT32_(2)                                          /* (SYSCTRL_PCLKSR) OSC32K Ready Position */
#define SYSCTRL_PCLKSR_OSC32KRDY_Msk          (_UINT32_(0x1) << SYSCTRL_PCLKSR_OSC32KRDY_Pos)      /* (SYSCTRL_PCLKSR) OSC32K Ready Mask */
#define SYSCTRL_PCLKSR_OSC32KRDY(value)       (SYSCTRL_PCLKSR_OSC32KRDY_Msk & (_UINT32_(value) << SYSCTRL_PCLKSR_OSC32KRDY_Pos)) /* Assigment of value for OSC32KRDY in the SYSCTRL_PCLKSR register */
#define SYSCTRL_PCLKSR_OSC8MRDY_Pos           _UINT32_(3)                                          /* (SYSCTRL_PCLKSR) OSC8M Ready Position */
#define SYSCTRL_PCLKSR_OSC8MRDY_Msk           (_UINT32_(0x1) << SYSCTRL_PCLKSR_OSC8MRDY_Pos)       /* (SYSCTRL_PCLKSR) OSC8M Ready Mask */
#define SYSCTRL_PCLKSR_OSC8MRDY(value)        (SYSCTRL_PCLKSR_OSC8MRDY_Msk & (_UINT32_(value) << SYSCTRL_PCLKSR_OSC8MRDY_Pos)) /* Assigment of value for OSC8MRDY in the SYSCTRL_PCLKSR register */
#define SYSCTRL_PCLKSR_DFLLRDY_Pos            _UINT32_(4)                                          /* (SYSCTRL_PCLKSR) DFLL Ready Position */
#define SYSCTRL_PCLKSR_DFLLRDY_Msk            (_UINT32_(0x1) << SYSCTRL_PCLKSR_DFLLRDY_Pos)        /* (SYSCTRL_PCLKSR) DFLL Ready Mask */
#define SYSCTRL_PCLKSR_DFLLRDY(value)         (SYSCTRL_PCLKSR_DFLLRDY_Msk & (_UINT32_(value) << SYSCTRL_PCLKSR_DFLLRDY_Pos)) /* Assigment of value for DFLLRDY in the SYSCTRL_PCLKSR register */
#define SYSCTRL_PCLKSR_DFLLOOB_Pos            _UINT32_(5)                                          /* (SYSCTRL_PCLKSR) DFLL Out Of Bounds Position */
#define SYSCTRL_PCLKSR_DFLLOOB_Msk            (_UINT32_(0x1) << SYSCTRL_PCLKSR_DFLLOOB_Pos)        /* (SYSCTRL_PCLKSR) DFLL Out Of Bounds Mask */
#define SYSCTRL_PCLKSR_DFLLOOB(value)         (SYSCTRL_PCLKSR_DFLLOOB_Msk & (_UINT32_(value) << SYSCTRL_PCLKSR_DFLLOOB_Pos)) /* Assigment of value for DFLLOOB in the SYSCTRL_PCLKSR register */
#define SYSCTRL_PCLKSR_DFLLLCKF_Pos           _UINT32_(6)                                          /* (SYSCTRL_PCLKSR) DFLL Lock Fine Position */
#define SYSCTRL_PCLKSR_DFLLLCKF_Msk           (_UINT32_(0x1) << SYSCTRL_PCLKSR_DFLLLCKF_Pos)       /* (SYSCTRL_PCLKSR) DFLL Lock Fine Mask */
#define SYSCTRL_PCLKSR_DFLLLCKF(value)        (SYSCTRL_PCLKSR_DFLLLCKF_Msk & (_UINT32_(value) << SYSCTRL_PCLKSR_DFLLLCKF_Pos)) /* Assigment of value for DFLLLCKF in the SYSCTRL_PCLKSR register */
#define SYSCTRL_PCLKSR_DFLLLCKC_Pos           _UINT32_(7)                                          /* (SYSCTRL_PCLKSR) DFLL Lock Coarse Position */
#define SYSCTRL_PCLKSR_DFLLLCKC_Msk           (_UINT32_(0x1) << SYSCTRL_PCLKSR_DFLLLCKC_Pos)       /* (SYSCTRL_PCLKSR) DFLL Lock Coarse Mask */
#define SYSCTRL_PCLKSR_DFLLLCKC(value)        (SYSCTRL_PCLKSR_DFLLLCKC_Msk & (_UINT32_(value) << SYSCTRL_PCLKSR_DFLLLCKC_Pos)) /* Assigment of value for DFLLLCKC in the SYSCTRL_PCLKSR register */
#define SYSCTRL_PCLKSR_DFLLRCS_Pos            _UINT32_(8)                                          /* (SYSCTRL_PCLKSR) DFLL Reference Clock Stopped Position */
#define SYSCTRL_PCLKSR_DFLLRCS_Msk            (_UINT32_(0x1) << SYSCTRL_PCLKSR_DFLLRCS_Pos)        /* (SYSCTRL_PCLKSR) DFLL Reference Clock Stopped Mask */
#define SYSCTRL_PCLKSR_DFLLRCS(value)         (SYSCTRL_PCLKSR_DFLLRCS_Msk & (_UINT32_(value) << SYSCTRL_PCLKSR_DFLLRCS_Pos)) /* Assigment of value for DFLLRCS in the SYSCTRL_PCLKSR register */
#define SYSCTRL_PCLKSR_BOD33RDY_Pos           _UINT32_(9)                                          /* (SYSCTRL_PCLKSR) BOD33 Ready Position */
#define SYSCTRL_PCLKSR_BOD33RDY_Msk           (_UINT32_(0x1) << SYSCTRL_PCLKSR_BOD33RDY_Pos)       /* (SYSCTRL_PCLKSR) BOD33 Ready Mask */
#define SYSCTRL_PCLKSR_BOD33RDY(value)        (SYSCTRL_PCLKSR_BOD33RDY_Msk & (_UINT32_(value) << SYSCTRL_PCLKSR_BOD33RDY_Pos)) /* Assigment of value for BOD33RDY in the SYSCTRL_PCLKSR register */
#define SYSCTRL_PCLKSR_BOD33DET_Pos           _UINT32_(10)                                         /* (SYSCTRL_PCLKSR) BOD33 Detection Position */
#define SYSCTRL_PCLKSR_BOD33DET_Msk           (_UINT32_(0x1) << SYSCTRL_PCLKSR_BOD33DET_Pos)       /* (SYSCTRL_PCLKSR) BOD33 Detection Mask */
#define SYSCTRL_PCLKSR_BOD33DET(value)        (SYSCTRL_PCLKSR_BOD33DET_Msk & (_UINT32_(value) << SYSCTRL_PCLKSR_BOD33DET_Pos)) /* Assigment of value for BOD33DET in the SYSCTRL_PCLKSR register */
#define SYSCTRL_PCLKSR_B33SRDY_Pos            _UINT32_(11)                                         /* (SYSCTRL_PCLKSR) BOD33 Synchronization Ready Position */
#define SYSCTRL_PCLKSR_B33SRDY_Msk            (_UINT32_(0x1) << SYSCTRL_PCLKSR_B33SRDY_Pos)        /* (SYSCTRL_PCLKSR) BOD33 Synchronization Ready Mask */
#define SYSCTRL_PCLKSR_B33SRDY(value)         (SYSCTRL_PCLKSR_B33SRDY_Msk & (_UINT32_(value) << SYSCTRL_PCLKSR_B33SRDY_Pos)) /* Assigment of value for B33SRDY in the SYSCTRL_PCLKSR register */
#define SYSCTRL_PCLKSR_DPLLLCKR_Pos           _UINT32_(15)                                         /* (SYSCTRL_PCLKSR) DPLL Lock Rise Position */
#define SYSCTRL_PCLKSR_DPLLLCKR_Msk           (_UINT32_(0x1) << SYSCTRL_PCLKSR_DPLLLCKR_Pos)       /* (SYSCTRL_PCLKSR) DPLL Lock Rise Mask */
#define SYSCTRL_PCLKSR_DPLLLCKR(value)        (SYSCTRL_PCLKSR_DPLLLCKR_Msk & (_UINT32_(value) << SYSCTRL_PCLKSR_DPLLLCKR_Pos)) /* Assigment of value for DPLLLCKR in the SYSCTRL_PCLKSR register */
#define SYSCTRL_PCLKSR_DPLLLCKF_Pos           _UINT32_(16)                                         /* (SYSCTRL_PCLKSR) DPLL Lock Fall Position */
#define SYSCTRL_PCLKSR_DPLLLCKF_Msk           (_UINT32_(0x1) << SYSCTRL_PCLKSR_DPLLLCKF_Pos)       /* (SYSCTRL_PCLKSR) DPLL Lock Fall Mask */
#define SYSCTRL_PCLKSR_DPLLLCKF(value)        (SYSCTRL_PCLKSR_DPLLLCKF_Msk & (_UINT32_(value) << SYSCTRL_PCLKSR_DPLLLCKF_Pos)) /* Assigment of value for DPLLLCKF in the SYSCTRL_PCLKSR register */
#define SYSCTRL_PCLKSR_DPLLLTO_Pos            _UINT32_(17)                                         /* (SYSCTRL_PCLKSR) DPLL Lock Timeout Position */
#define SYSCTRL_PCLKSR_DPLLLTO_Msk            (_UINT32_(0x1) << SYSCTRL_PCLKSR_DPLLLTO_Pos)        /* (SYSCTRL_PCLKSR) DPLL Lock Timeout Mask */
#define SYSCTRL_PCLKSR_DPLLLTO(value)         (SYSCTRL_PCLKSR_DPLLLTO_Msk & (_UINT32_(value) << SYSCTRL_PCLKSR_DPLLLTO_Pos)) /* Assigment of value for DPLLLTO in the SYSCTRL_PCLKSR register */
#define SYSCTRL_PCLKSR_Msk                    _UINT32_(0x00038FFF)                                 /* (SYSCTRL_PCLKSR) Register Mask  */


/* -------- SYSCTRL_XOSC : (SYSCTRL Offset: 0x10) (R/W 16) External Multipurpose Crystal Oscillator (XOSC) Control -------- */
#define SYSCTRL_XOSC_RESETVALUE               _UINT16_(0x80)                                       /*  (SYSCTRL_XOSC) External Multipurpose Crystal Oscillator (XOSC) Control  Reset Value */

#define SYSCTRL_XOSC_ENABLE_Pos               _UINT16_(1)                                          /* (SYSCTRL_XOSC) Oscillator Enable Position */
#define SYSCTRL_XOSC_ENABLE_Msk               (_UINT16_(0x1) << SYSCTRL_XOSC_ENABLE_Pos)           /* (SYSCTRL_XOSC) Oscillator Enable Mask */
#define SYSCTRL_XOSC_ENABLE(value)            (SYSCTRL_XOSC_ENABLE_Msk & (_UINT16_(value) << SYSCTRL_XOSC_ENABLE_Pos)) /* Assigment of value for ENABLE in the SYSCTRL_XOSC register */
#define SYSCTRL_XOSC_XTALEN_Pos               _UINT16_(2)                                          /* (SYSCTRL_XOSC) Crystal Oscillator Enable Position */
#define SYSCTRL_XOSC_XTALEN_Msk               (_UINT16_(0x1) << SYSCTRL_XOSC_XTALEN_Pos)           /* (SYSCTRL_XOSC) Crystal Oscillator Enable Mask */
#define SYSCTRL_XOSC_XTALEN(value)            (SYSCTRL_XOSC_XTALEN_Msk & (_UINT16_(value) << SYSCTRL_XOSC_XTALEN_Pos)) /* Assigment of value for XTALEN in the SYSCTRL_XOSC register */
#define SYSCTRL_XOSC_RUNSTDBY_Pos             _UINT16_(6)                                          /* (SYSCTRL_XOSC) Run in Standby Position */
#define SYSCTRL_XOSC_RUNSTDBY_Msk             (_UINT16_(0x1) << SYSCTRL_XOSC_RUNSTDBY_Pos)         /* (SYSCTRL_XOSC) Run in Standby Mask */
#define SYSCTRL_XOSC_RUNSTDBY(value)          (SYSCTRL_XOSC_RUNSTDBY_Msk & (_UINT16_(value) << SYSCTRL_XOSC_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SYSCTRL_XOSC register */
#define SYSCTRL_XOSC_ONDEMAND_Pos             _UINT16_(7)                                          /* (SYSCTRL_XOSC) On Demand Control Position */
#define SYSCTRL_XOSC_ONDEMAND_Msk             (_UINT16_(0x1) << SYSCTRL_XOSC_ONDEMAND_Pos)         /* (SYSCTRL_XOSC) On Demand Control Mask */
#define SYSCTRL_XOSC_ONDEMAND(value)          (SYSCTRL_XOSC_ONDEMAND_Msk & (_UINT16_(value) << SYSCTRL_XOSC_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the SYSCTRL_XOSC register */
#define SYSCTRL_XOSC_GAIN_Pos                 _UINT16_(8)                                          /* (SYSCTRL_XOSC) Oscillator Gain Position */
#define SYSCTRL_XOSC_GAIN_Msk                 (_UINT16_(0x7) << SYSCTRL_XOSC_GAIN_Pos)             /* (SYSCTRL_XOSC) Oscillator Gain Mask */
#define SYSCTRL_XOSC_GAIN(value)              (SYSCTRL_XOSC_GAIN_Msk & (_UINT16_(value) << SYSCTRL_XOSC_GAIN_Pos)) /* Assigment of value for GAIN in the SYSCTRL_XOSC register */
#define   SYSCTRL_XOSC_GAIN_0_Val             _UINT16_(0x0)                                        /* (SYSCTRL_XOSC) 2MHz  */
#define   SYSCTRL_XOSC_GAIN_1_Val             _UINT16_(0x1)                                        /* (SYSCTRL_XOSC) 4MHz  */
#define   SYSCTRL_XOSC_GAIN_2_Val             _UINT16_(0x2)                                        /* (SYSCTRL_XOSC) 8MHz  */
#define   SYSCTRL_XOSC_GAIN_3_Val             _UINT16_(0x3)                                        /* (SYSCTRL_XOSC) 16MHz  */
#define   SYSCTRL_XOSC_GAIN_4_Val             _UINT16_(0x4)                                        /* (SYSCTRL_XOSC) 30MHz  */
#define SYSCTRL_XOSC_GAIN_0                   (SYSCTRL_XOSC_GAIN_0_Val << SYSCTRL_XOSC_GAIN_Pos)   /* (SYSCTRL_XOSC) 2MHz Position  */
#define SYSCTRL_XOSC_GAIN_1                   (SYSCTRL_XOSC_GAIN_1_Val << SYSCTRL_XOSC_GAIN_Pos)   /* (SYSCTRL_XOSC) 4MHz Position  */
#define SYSCTRL_XOSC_GAIN_2                   (SYSCTRL_XOSC_GAIN_2_Val << SYSCTRL_XOSC_GAIN_Pos)   /* (SYSCTRL_XOSC) 8MHz Position  */
#define SYSCTRL_XOSC_GAIN_3                   (SYSCTRL_XOSC_GAIN_3_Val << SYSCTRL_XOSC_GAIN_Pos)   /* (SYSCTRL_XOSC) 16MHz Position  */
#define SYSCTRL_XOSC_GAIN_4                   (SYSCTRL_XOSC_GAIN_4_Val << SYSCTRL_XOSC_GAIN_Pos)   /* (SYSCTRL_XOSC) 30MHz Position  */
#define SYSCTRL_XOSC_AMPGC_Pos                _UINT16_(11)                                         /* (SYSCTRL_XOSC) Automatic Amplitude Gain Control Position */
#define SYSCTRL_XOSC_AMPGC_Msk                (_UINT16_(0x1) << SYSCTRL_XOSC_AMPGC_Pos)            /* (SYSCTRL_XOSC) Automatic Amplitude Gain Control Mask */
#define SYSCTRL_XOSC_AMPGC(value)             (SYSCTRL_XOSC_AMPGC_Msk & (_UINT16_(value) << SYSCTRL_XOSC_AMPGC_Pos)) /* Assigment of value for AMPGC in the SYSCTRL_XOSC register */
#define SYSCTRL_XOSC_STARTUP_Pos              _UINT16_(12)                                         /* (SYSCTRL_XOSC) Start-Up Time Position */
#define SYSCTRL_XOSC_STARTUP_Msk              (_UINT16_(0xF) << SYSCTRL_XOSC_STARTUP_Pos)          /* (SYSCTRL_XOSC) Start-Up Time Mask */
#define SYSCTRL_XOSC_STARTUP(value)           (SYSCTRL_XOSC_STARTUP_Msk & (_UINT16_(value) << SYSCTRL_XOSC_STARTUP_Pos)) /* Assigment of value for STARTUP in the SYSCTRL_XOSC register */
#define   SYSCTRL_XOSC_STARTUP_CYCLE1_Val     _UINT16_(0x0)                                        /* (SYSCTRL_XOSC) 31 us  */
#define   SYSCTRL_XOSC_STARTUP_CYCLE2_Val     _UINT16_(0x1)                                        /* (SYSCTRL_XOSC) 61 us  */
#define   SYSCTRL_XOSC_STARTUP_CYCLE4_Val     _UINT16_(0x2)                                        /* (SYSCTRL_XOSC) 122 us  */
#define   SYSCTRL_XOSC_STARTUP_CYCLE8_Val     _UINT16_(0x3)                                        /* (SYSCTRL_XOSC) 244 us  */
#define   SYSCTRL_XOSC_STARTUP_CYCLE16_Val    _UINT16_(0x4)                                        /* (SYSCTRL_XOSC) 488 us  */
#define   SYSCTRL_XOSC_STARTUP_CYCLE32_Val    _UINT16_(0x5)                                        /* (SYSCTRL_XOSC) 977 us  */
#define   SYSCTRL_XOSC_STARTUP_CYCLE64_Val    _UINT16_(0x6)                                        /* (SYSCTRL_XOSC) 1953 us  */
#define   SYSCTRL_XOSC_STARTUP_CYCLE128_Val   _UINT16_(0x7)                                        /* (SYSCTRL_XOSC) 3906 us  */
#define   SYSCTRL_XOSC_STARTUP_CYCLE256_Val   _UINT16_(0x8)                                        /* (SYSCTRL_XOSC) 7813 us  */
#define   SYSCTRL_XOSC_STARTUP_CYCLE512_Val   _UINT16_(0x9)                                        /* (SYSCTRL_XOSC) 15625 us  */
#define   SYSCTRL_XOSC_STARTUP_CYCLE1024_Val  _UINT16_(0xA)                                        /* (SYSCTRL_XOSC) 31250 us  */
#define   SYSCTRL_XOSC_STARTUP_CYCLE2048_Val  _UINT16_(0xB)                                        /* (SYSCTRL_XOSC) 62500 us  */
#define   SYSCTRL_XOSC_STARTUP_CYCLE4096_Val  _UINT16_(0xC)                                        /* (SYSCTRL_XOSC) 125000 us  */
#define   SYSCTRL_XOSC_STARTUP_CYCLE8192_Val  _UINT16_(0xD)                                        /* (SYSCTRL_XOSC) 250000 us  */
#define   SYSCTRL_XOSC_STARTUP_CYCLE16384_Val _UINT16_(0xE)                                        /* (SYSCTRL_XOSC) 500000 us  */
#define   SYSCTRL_XOSC_STARTUP_CYCLE32768_Val _UINT16_(0xF)                                        /* (SYSCTRL_XOSC) 1000000 us  */
#define SYSCTRL_XOSC_STARTUP_CYCLE1           (SYSCTRL_XOSC_STARTUP_CYCLE1_Val << SYSCTRL_XOSC_STARTUP_Pos) /* (SYSCTRL_XOSC) 31 us Position  */
#define SYSCTRL_XOSC_STARTUP_CYCLE2           (SYSCTRL_XOSC_STARTUP_CYCLE2_Val << SYSCTRL_XOSC_STARTUP_Pos) /* (SYSCTRL_XOSC) 61 us Position  */
#define SYSCTRL_XOSC_STARTUP_CYCLE4           (SYSCTRL_XOSC_STARTUP_CYCLE4_Val << SYSCTRL_XOSC_STARTUP_Pos) /* (SYSCTRL_XOSC) 122 us Position  */
#define SYSCTRL_XOSC_STARTUP_CYCLE8           (SYSCTRL_XOSC_STARTUP_CYCLE8_Val << SYSCTRL_XOSC_STARTUP_Pos) /* (SYSCTRL_XOSC) 244 us Position  */
#define SYSCTRL_XOSC_STARTUP_CYCLE16          (SYSCTRL_XOSC_STARTUP_CYCLE16_Val << SYSCTRL_XOSC_STARTUP_Pos) /* (SYSCTRL_XOSC) 488 us Position  */
#define SYSCTRL_XOSC_STARTUP_CYCLE32          (SYSCTRL_XOSC_STARTUP_CYCLE32_Val << SYSCTRL_XOSC_STARTUP_Pos) /* (SYSCTRL_XOSC) 977 us Position  */
#define SYSCTRL_XOSC_STARTUP_CYCLE64          (SYSCTRL_XOSC_STARTUP_CYCLE64_Val << SYSCTRL_XOSC_STARTUP_Pos) /* (SYSCTRL_XOSC) 1953 us Position  */
#define SYSCTRL_XOSC_STARTUP_CYCLE128         (SYSCTRL_XOSC_STARTUP_CYCLE128_Val << SYSCTRL_XOSC_STARTUP_Pos) /* (SYSCTRL_XOSC) 3906 us Position  */
#define SYSCTRL_XOSC_STARTUP_CYCLE256         (SYSCTRL_XOSC_STARTUP_CYCLE256_Val << SYSCTRL_XOSC_STARTUP_Pos) /* (SYSCTRL_XOSC) 7813 us Position  */
#define SYSCTRL_XOSC_STARTUP_CYCLE512         (SYSCTRL_XOSC_STARTUP_CYCLE512_Val << SYSCTRL_XOSC_STARTUP_Pos) /* (SYSCTRL_XOSC) 15625 us Position  */
#define SYSCTRL_XOSC_STARTUP_CYCLE1024        (SYSCTRL_XOSC_STARTUP_CYCLE1024_Val << SYSCTRL_XOSC_STARTUP_Pos) /* (SYSCTRL_XOSC) 31250 us Position  */
#define SYSCTRL_XOSC_STARTUP_CYCLE2048        (SYSCTRL_XOSC_STARTUP_CYCLE2048_Val << SYSCTRL_XOSC_STARTUP_Pos) /* (SYSCTRL_XOSC) 62500 us Position  */
#define SYSCTRL_XOSC_STARTUP_CYCLE4096        (SYSCTRL_XOSC_STARTUP_CYCLE4096_Val << SYSCTRL_XOSC_STARTUP_Pos) /* (SYSCTRL_XOSC) 125000 us Position  */
#define SYSCTRL_XOSC_STARTUP_CYCLE8192        (SYSCTRL_XOSC_STARTUP_CYCLE8192_Val << SYSCTRL_XOSC_STARTUP_Pos) /* (SYSCTRL_XOSC) 250000 us Position  */
#define SYSCTRL_XOSC_STARTUP_CYCLE16384       (SYSCTRL_XOSC_STARTUP_CYCLE16384_Val << SYSCTRL_XOSC_STARTUP_Pos) /* (SYSCTRL_XOSC) 500000 us Position  */
#define SYSCTRL_XOSC_STARTUP_CYCLE32768       (SYSCTRL_XOSC_STARTUP_CYCLE32768_Val << SYSCTRL_XOSC_STARTUP_Pos) /* (SYSCTRL_XOSC) 1000000 us Position  */
#define SYSCTRL_XOSC_Msk                      _UINT16_(0xFFC6)                                     /* (SYSCTRL_XOSC) Register Mask  */


/* -------- SYSCTRL_XOSC32K : (SYSCTRL Offset: 0x14) (R/W 16) 32kHz External Crystal Oscillator (XOSC32K) Control -------- */
#define SYSCTRL_XOSC32K_RESETVALUE            _UINT16_(0x80)                                       /*  (SYSCTRL_XOSC32K) 32kHz External Crystal Oscillator (XOSC32K) Control  Reset Value */

