MicrochipTech/oa-tc6-lib/examples/lwIP-SAM-D21-Curiosity-Nano/firmware/src/packs/ATSAMD21G17D_DFP/component/sysctrl.h
#define SYSCTRL_DFLLCTRL_ENABLE_Pos           _UINT16_(1)                                          /* (SYSCTRL_DFLLCTRL) DFLL Enable Position */
#define SYSCTRL_DFLLCTRL_ENABLE_Msk           (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_ENABLE_Pos)       /* (SYSCTRL_DFLLCTRL) DFLL Enable Mask */
#define SYSCTRL_DFLLCTRL_ENABLE(value)        (SYSCTRL_DFLLCTRL_ENABLE_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_MODE_Pos             _UINT16_(2)                                          /* (SYSCTRL_DFLLCTRL) Operating Mode Selection Position */
#define SYSCTRL_DFLLCTRL_MODE_Msk             (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_MODE_Pos)         /* (SYSCTRL_DFLLCTRL) Operating Mode Selection Mask */
#define SYSCTRL_DFLLCTRL_MODE(value)          (SYSCTRL_DFLLCTRL_MODE_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_MODE_Pos)) /* Assigment of value for MODE in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_STABLE_Pos           _UINT16_(3)                                          /* (SYSCTRL_DFLLCTRL) Stable DFLL Frequency Position */
#define SYSCTRL_DFLLCTRL_STABLE_Msk           (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_STABLE_Pos)       /* (SYSCTRL_DFLLCTRL) Stable DFLL Frequency Mask */
#define SYSCTRL_DFLLCTRL_STABLE(value)        (SYSCTRL_DFLLCTRL_STABLE_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_STABLE_Pos)) /* Assigment of value for STABLE in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_LLAW_Pos             _UINT16_(4)                                          /* (SYSCTRL_DFLLCTRL) Lose Lock After Wake Position */
#define SYSCTRL_DFLLCTRL_LLAW_Msk             (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_LLAW_Pos)         /* (SYSCTRL_DFLLCTRL) Lose Lock After Wake Mask */
#define SYSCTRL_DFLLCTRL_LLAW(value)          (SYSCTRL_DFLLCTRL_LLAW_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_LLAW_Pos)) /* Assigment of value for LLAW in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_USBCRM_Pos           _UINT16_(5)                                          /* (SYSCTRL_DFLLCTRL) USB Clock Recovery Mode Position */
#define SYSCTRL_DFLLCTRL_USBCRM_Msk           (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_USBCRM_Pos)       /* (SYSCTRL_DFLLCTRL) USB Clock Recovery Mode Mask */
#define SYSCTRL_DFLLCTRL_USBCRM(value)        (SYSCTRL_DFLLCTRL_USBCRM_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_USBCRM_Pos)) /* Assigment of value for USBCRM in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_RUNSTDBY_Pos         _UINT16_(6)                                          /* (SYSCTRL_DFLLCTRL) Run in Standby Position */
#define SYSCTRL_DFLLCTRL_RUNSTDBY_Msk         (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_RUNSTDBY_Pos)     /* (SYSCTRL_DFLLCTRL) Run in Standby Mask */
#define SYSCTRL_DFLLCTRL_RUNSTDBY(value)      (SYSCTRL_DFLLCTRL_RUNSTDBY_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_ONDEMAND_Pos         _UINT16_(7)                                          /* (SYSCTRL_DFLLCTRL) On Demand Control Position */
#define SYSCTRL_DFLLCTRL_ONDEMAND_Msk         (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_ONDEMAND_Pos)     /* (SYSCTRL_DFLLCTRL) On Demand Control Mask */
#define SYSCTRL_DFLLCTRL_ONDEMAND(value)      (SYSCTRL_DFLLCTRL_ONDEMAND_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_CCDIS_Pos            _UINT16_(8)                                          /* (SYSCTRL_DFLLCTRL) Chill Cycle Disable Position */
#define SYSCTRL_DFLLCTRL_CCDIS_Msk            (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_CCDIS_Pos)        /* (SYSCTRL_DFLLCTRL) Chill Cycle Disable Mask */
#define SYSCTRL_DFLLCTRL_CCDIS(value)         (SYSCTRL_DFLLCTRL_CCDIS_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_CCDIS_Pos)) /* Assigment of value for CCDIS in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_QLDIS_Pos            _UINT16_(9)                                          /* (SYSCTRL_DFLLCTRL) Quick Lock Disable Position */
#define SYSCTRL_DFLLCTRL_QLDIS_Msk            (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_QLDIS_Pos)        /* (SYSCTRL_DFLLCTRL) Quick Lock Disable Mask */
#define SYSCTRL_DFLLCTRL_QLDIS(value)         (SYSCTRL_DFLLCTRL_QLDIS_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_QLDIS_Pos)) /* Assigment of value for QLDIS in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_BPLCKC_Pos           _UINT16_(10)                                         /* (SYSCTRL_DFLLCTRL) Bypass Coarse Lock Position */
#define SYSCTRL_DFLLCTRL_BPLCKC_Msk           (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_BPLCKC_Pos)       /* (SYSCTRL_DFLLCTRL) Bypass Coarse Lock Mask */
#define SYSCTRL_DFLLCTRL_BPLCKC(value)        (SYSCTRL_DFLLCTRL_BPLCKC_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_BPLCKC_Pos)) /* Assigment of value for BPLCKC in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_WAITLOCK_Pos         _UINT16_(11)                                         /* (SYSCTRL_DFLLCTRL) Wait Lock Position */
#define SYSCTRL_DFLLCTRL_WAITLOCK_Msk         (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_WAITLOCK_Pos)     /* (SYSCTRL_DFLLCTRL) Wait Lock Mask */
#define SYSCTRL_DFLLCTRL_WAITLOCK(value)      (SYSCTRL_DFLLCTRL_WAITLOCK_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_WAITLOCK_Pos)) /* Assigment of value for WAITLOCK in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_Msk                  _UINT16_(0x0FFE)                                     /* (SYSCTRL_DFLLCTRL) Register Mask  */


/* -------- SYSCTRL_DFLLVAL : (SYSCTRL Offset: 0x28) (R/W 32) DFLL48M Value -------- */
#define SYSCTRL_DFLLVAL_RESETVALUE            _UINT32_(0x00)                                       /*  (SYSCTRL_DFLLVAL) DFLL48M Value  Reset Value */

#define SYSCTRL_DFLLVAL_FINE_Pos              _UINT32_(0)                                          /* (SYSCTRL_DFLLVAL) Fine Value Position */
#define SYSCTRL_DFLLVAL_FINE_Msk              (_UINT32_(0x3FF) << SYSCTRL_DFLLVAL_FINE_Pos)        /* (SYSCTRL_DFLLVAL) Fine Value Mask */
#define SYSCTRL_DFLLVAL_FINE(value)           (SYSCTRL_DFLLVAL_FINE_Msk & (_UINT32_(value) << SYSCTRL_DFLLVAL_FINE_Pos)) /* Assigment of value for FINE in the SYSCTRL_DFLLVAL register */
#define SYSCTRL_DFLLVAL_COARSE_Pos            _UINT32_(10)                                         /* (SYSCTRL_DFLLVAL) Coarse Value Position */
#define SYSCTRL_DFLLVAL_COARSE_Msk            (_UINT32_(0x3F) << SYSCTRL_DFLLVAL_COARSE_Pos)       /* (SYSCTRL_DFLLVAL) Coarse Value Mask */
#define SYSCTRL_DFLLVAL_COARSE(value)         (SYSCTRL_DFLLVAL_COARSE_Msk & (_UINT32_(value) << SYSCTRL_DFLLVAL_COARSE_Pos)) /* Assigment of value for COARSE in the SYSCTRL_DFLLVAL register */
#define SYSCTRL_DFLLVAL_DIFF_Pos              _UINT32_(16)                                         /* (SYSCTRL_DFLLVAL) Multiplication Ratio Difference Position */
#define SYSCTRL_DFLLVAL_DIFF_Msk              (_UINT32_(0xFFFF) << SYSCTRL_DFLLVAL_DIFF_Pos)       /* (SYSCTRL_DFLLVAL) Multiplication Ratio Difference Mask */
#define SYSCTRL_DFLLVAL_DIFF(value)           (SYSCTRL_DFLLVAL_DIFF_Msk & (_UINT32_(value) << SYSCTRL_DFLLVAL_DIFF_Pos)) /* Assigment of value for DIFF in the SYSCTRL_DFLLVAL register */
#define SYSCTRL_DFLLVAL_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (SYSCTRL_DFLLVAL) Register Mask  */


/* -------- SYSCTRL_DFLLMUL : (SYSCTRL Offset: 0x2C) (R/W 32) DFLL48M Multiplier -------- */
#define SYSCTRL_DFLLMUL_RESETVALUE            _UINT32_(0x00)                                       /*  (SYSCTRL_DFLLMUL) DFLL48M Multiplier  Reset Value */

#define SYSCTRL_DFLLMUL_MUL_Pos               _UINT32_(0)                                          /* (SYSCTRL_DFLLMUL) DFLL Multiply Factor Position */
#define SYSCTRL_DFLLMUL_MUL_Msk               (_UINT32_(0xFFFF) << SYSCTRL_DFLLMUL_MUL_Pos)        /* (SYSCTRL_DFLLMUL) DFLL Multiply Factor Mask */
#define SYSCTRL_DFLLMUL_MUL(value)            (SYSCTRL_DFLLMUL_MUL_Msk & (_UINT32_(value) << SYSCTRL_DFLLMUL_MUL_Pos)) /* Assigment of value for MUL in the SYSCTRL_DFLLMUL register */
#define SYSCTRL_DFLLMUL_FSTEP_Pos             _UINT32_(16)                                         /* (SYSCTRL_DFLLMUL) Fine Maximum Step Position */
#define SYSCTRL_DFLLMUL_FSTEP_Msk             (_UINT32_(0x3FF) << SYSCTRL_DFLLMUL_FSTEP_Pos)       /* (SYSCTRL_DFLLMUL) Fine Maximum Step Mask */
#define SYSCTRL_DFLLMUL_FSTEP(value)          (SYSCTRL_DFLLMUL_FSTEP_Msk & (_UINT32_(value) << SYSCTRL_DFLLMUL_FSTEP_Pos)) /* Assigment of value for FSTEP in the SYSCTRL_DFLLMUL register */
#define SYSCTRL_DFLLMUL_CSTEP_Pos             _UINT32_(26)                                         /* (SYSCTRL_DFLLMUL) Coarse Maximum Step Position */
#define SYSCTRL_DFLLMUL_CSTEP_Msk             (_UINT32_(0x3F) << SYSCTRL_DFLLMUL_CSTEP_Pos)        /* (SYSCTRL_DFLLMUL) Coarse Maximum Step Mask */
#define SYSCTRL_DFLLMUL_CSTEP(value)          (SYSCTRL_DFLLMUL_CSTEP_Msk & (_UINT32_(value) << SYSCTRL_DFLLMUL_CSTEP_Pos)) /* Assigment of value for CSTEP in the SYSCTRL_DFLLMUL register */
#define SYSCTRL_DFLLMUL_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (SYSCTRL_DFLLMUL) Register Mask  */


/* -------- SYSCTRL_DFLLSYNC : (SYSCTRL Offset: 0x30) (R/W 8) DFLL48M Synchronization -------- */
#define SYSCTRL_DFLLSYNC_RESETVALUE           _UINT8_(0x00)                                        /*  (SYSCTRL_DFLLSYNC) DFLL48M Synchronization  Reset Value */

#define SYSCTRL_DFLLSYNC_READREQ_Pos          _UINT8_(7)                                           /* (SYSCTRL_DFLLSYNC) Read Request Position */
#define SYSCTRL_DFLLSYNC_READREQ_Msk          (_UINT8_(0x1) << SYSCTRL_DFLLSYNC_READREQ_Pos)       /* (SYSCTRL_DFLLSYNC) Read Request Mask */
#define SYSCTRL_DFLLSYNC_READREQ(value)       (SYSCTRL_DFLLSYNC_READREQ_Msk & (_UINT8_(value) << SYSCTRL_DFLLSYNC_READREQ_Pos)) /* Assigment of value for READREQ in the SYSCTRL_DFLLSYNC register */
#define SYSCTRL_DFLLSYNC_Msk                  _UINT8_(0x80)                                        /* (SYSCTRL_DFLLSYNC) Register Mask  */


/* -------- SYSCTRL_BOD33 : (SYSCTRL Offset: 0x34) (R/W 32) 3.3V Brown-Out Detector (BOD33) Control -------- */
#define SYSCTRL_BOD33_RESETVALUE              _UINT32_(0x00)                                       /*  (SYSCTRL_BOD33) 3.3V Brown-Out Detector (BOD33) Control  Reset Value */

#define SYSCTRL_BOD33_ENABLE_Pos              _UINT32_(1)                                          /* (SYSCTRL_BOD33) Enable Position */
#define SYSCTRL_BOD33_ENABLE_Msk              (_UINT32_(0x1) << SYSCTRL_BOD33_ENABLE_Pos)          /* (SYSCTRL_BOD33) Enable Mask */
#define SYSCTRL_BOD33_ENABLE(value)           (SYSCTRL_BOD33_ENABLE_Msk & (_UINT32_(value) << SYSCTRL_BOD33_ENABLE_Pos)) /* Assigment of value for ENABLE in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_HYST_Pos                _UINT32_(2)                                          /* (SYSCTRL_BOD33) Hysteresis Position */
#define SYSCTRL_BOD33_HYST_Msk                (_UINT32_(0x1) << SYSCTRL_BOD33_HYST_Pos)            /* (SYSCTRL_BOD33) Hysteresis Mask */
#define SYSCTRL_BOD33_HYST(value)             (SYSCTRL_BOD33_HYST_Msk & (_UINT32_(value) << SYSCTRL_BOD33_HYST_Pos)) /* Assigment of value for HYST in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_ACTION_Pos              _UINT32_(3)                                          /* (SYSCTRL_BOD33) BOD33 Action Position */
#define SYSCTRL_BOD33_ACTION_Msk              (_UINT32_(0x3) << SYSCTRL_BOD33_ACTION_Pos)          /* (SYSCTRL_BOD33) BOD33 Action Mask */
#define SYSCTRL_BOD33_ACTION(value)           (SYSCTRL_BOD33_ACTION_Msk & (_UINT32_(value) << SYSCTRL_BOD33_ACTION_Pos)) /* Assigment of value for ACTION in the SYSCTRL_BOD33 register */
#define   SYSCTRL_BOD33_ACTION_NONE_Val       _UINT32_(0x0)                                        /* (SYSCTRL_BOD33) No action  */
#define   SYSCTRL_BOD33_ACTION_RESET_Val      _UINT32_(0x1)                                        /* (SYSCTRL_BOD33) The BOD33 generates a reset  */
#define   SYSCTRL_BOD33_ACTION_INTERRUPT_Val  _UINT32_(0x2)                                        /* (SYSCTRL_BOD33) The BOD33 generates an interrupt  */
#define SYSCTRL_BOD33_ACTION_NONE             (SYSCTRL_BOD33_ACTION_NONE_Val << SYSCTRL_BOD33_ACTION_Pos) /* (SYSCTRL_BOD33) No action Position  */
#define SYSCTRL_BOD33_ACTION_RESET            (SYSCTRL_BOD33_ACTION_RESET_Val << SYSCTRL_BOD33_ACTION_Pos) /* (SYSCTRL_BOD33) The BOD33 generates a reset Position  */
#define SYSCTRL_BOD33_ACTION_INTERRUPT        (SYSCTRL_BOD33_ACTION_INTERRUPT_Val << SYSCTRL_BOD33_ACTION_Pos) /* (SYSCTRL_BOD33) The BOD33 generates an interrupt Position  */
#define SYSCTRL_BOD33_RUNSTDBY_Pos            _UINT32_(6)                                          /* (SYSCTRL_BOD33) Run in Standby Position */
#define SYSCTRL_BOD33_RUNSTDBY_Msk            (_UINT32_(0x1) << SYSCTRL_BOD33_RUNSTDBY_Pos)        /* (SYSCTRL_BOD33) Run in Standby Mask */
#define SYSCTRL_BOD33_RUNSTDBY(value)         (SYSCTRL_BOD33_RUNSTDBY_Msk & (_UINT32_(value) << SYSCTRL_BOD33_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_MODE_Pos                _UINT32_(8)                                          /* (SYSCTRL_BOD33) Operation Mode Position */
#define SYSCTRL_BOD33_MODE_Msk                (_UINT32_(0x1) << SYSCTRL_BOD33_MODE_Pos)            /* (SYSCTRL_BOD33) Operation Mode Mask */
#define SYSCTRL_BOD33_MODE(value)             (SYSCTRL_BOD33_MODE_Msk & (_UINT32_(value) << SYSCTRL_BOD33_MODE_Pos)) /* Assigment of value for MODE in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_CEN_Pos                 _UINT32_(9)                                          /* (SYSCTRL_BOD33) Clock Enable Position */
#define SYSCTRL_BOD33_CEN_Msk                 (_UINT32_(0x1) << SYSCTRL_BOD33_CEN_Pos)             /* (SYSCTRL_BOD33) Clock Enable Mask */
#define SYSCTRL_BOD33_CEN(value)              (SYSCTRL_BOD33_CEN_Msk & (_UINT32_(value) << SYSCTRL_BOD33_CEN_Pos)) /* Assigment of value for CEN in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_PSEL_Pos                _UINT32_(12)                                         /* (SYSCTRL_BOD33) Prescaler Select Position */
#define SYSCTRL_BOD33_PSEL_Msk                (_UINT32_(0xF) << SYSCTRL_BOD33_PSEL_Pos)            /* (SYSCTRL_BOD33) Prescaler Select Mask */
#define SYSCTRL_BOD33_PSEL(value)             (SYSCTRL_BOD33_PSEL_Msk & (_UINT32_(value) << SYSCTRL_BOD33_PSEL_Pos)) /* Assigment of value for PSEL in the SYSCTRL_BOD33 register */
#define   SYSCTRL_BOD33_PSEL_DIV2_Val         _UINT32_(0x0)                                        /* (SYSCTRL_BOD33) Divide clock by 2  */
#define   SYSCTRL_BOD33_PSEL_DIV4_Val         _UINT32_(0x1)                                        /* (SYSCTRL_BOD33) Divide clock by 4  */
#define   SYSCTRL_BOD33_PSEL_DIV8_Val         _UINT32_(0x2)                                        /* (SYSCTRL_BOD33) Divide clock by 8  */
#define   SYSCTRL_BOD33_PSEL_DIV16_Val        _UINT32_(0x3)                                        /* (SYSCTRL_BOD33) Divide clock by 16  */
#define   SYSCTRL_BOD33_PSEL_DIV32_Val        _UINT32_(0x4)                                        /* (SYSCTRL_BOD33) Divide clock by 32  */
#define   SYSCTRL_BOD33_PSEL_DIV64_Val        _UINT32_(0x5)                                        /* (SYSCTRL_BOD33) Divide clock by 64  */
#define   SYSCTRL_BOD33_PSEL_DIV128_Val       _UINT32_(0x6)                                        /* (SYSCTRL_BOD33) Divide clock by 128  */
#define   SYSCTRL_BOD33_PSEL_DIV256_Val       _UINT32_(0x7)                                        /* (SYSCTRL_BOD33) Divide clock by 256  */
#define   SYSCTRL_BOD33_PSEL_DIV512_Val       _UINT32_(0x8)                                        /* (SYSCTRL_BOD33) Divide clock by 512  */
#define   SYSCTRL_BOD33_PSEL_DIV1K_Val        _UINT32_(0x9)                                        /* (SYSCTRL_BOD33) Divide clock by 1024  */
#define   SYSCTRL_BOD33_PSEL_DIV2K_Val        _UINT32_(0xA)                                        /* (SYSCTRL_BOD33) Divide clock by 2048  */
#define   SYSCTRL_BOD33_PSEL_DIV4K_Val        _UINT32_(0xB)                                        /* (SYSCTRL_BOD33) Divide clock by 4096  */
#define   SYSCTRL_BOD33_PSEL_DIV8K_Val        _UINT32_(0xC)                                        /* (SYSCTRL_BOD33) Divide clock by 8192  */
#define   SYSCTRL_BOD33_PSEL_DIV16K_Val       _UINT32_(0xD)                                        /* (SYSCTRL_BOD33) Divide clock by 16384  */
#define   SYSCTRL_BOD33_PSEL_DIV32K_Val       _UINT32_(0xE)                                        /* (SYSCTRL_BOD33) Divide clock by 32768  */
#define   SYSCTRL_BOD33_PSEL_DIV64K_Val       _UINT32_(0xF)                                        /* (SYSCTRL_BOD33) Divide clock by 65536  */
#define SYSCTRL_BOD33_PSEL_DIV2               (SYSCTRL_BOD33_PSEL_DIV2_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 2 Position  */
#define SYSCTRL_BOD33_PSEL_DIV4               (SYSCTRL_BOD33_PSEL_DIV4_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 4 Position  */
#define SYSCTRL_BOD33_PSEL_DIV8               (SYSCTRL_BOD33_PSEL_DIV8_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 8 Position  */
#define SYSCTRL_BOD33_PSEL_DIV16              (SYSCTRL_BOD33_PSEL_DIV16_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 16 Position  */
#define SYSCTRL_BOD33_PSEL_DIV32              (SYSCTRL_BOD33_PSEL_DIV32_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 32 Position  */
#define SYSCTRL_BOD33_PSEL_DIV64              (SYSCTRL_BOD33_PSEL_DIV64_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 64 Position  */
#define SYSCTRL_BOD33_PSEL_DIV128             (SYSCTRL_BOD33_PSEL_DIV128_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 128 Position  */
#define SYSCTRL_BOD33_PSEL_DIV256             (SYSCTRL_BOD33_PSEL_DIV256_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 256 Position  */
#define SYSCTRL_BOD33_PSEL_DIV512             (SYSCTRL_BOD33_PSEL_DIV512_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 512 Position  */
#define SYSCTRL_BOD33_PSEL_DIV1K              (SYSCTRL_BOD33_PSEL_DIV1K_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 1024 Position  */
#define SYSCTRL_BOD33_PSEL_DIV2K              (SYSCTRL_BOD33_PSEL_DIV2K_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 2048 Position  */
#define SYSCTRL_BOD33_PSEL_DIV4K              (SYSCTRL_BOD33_PSEL_DIV4K_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 4096 Position  */
#define SYSCTRL_BOD33_PSEL_DIV8K              (SYSCTRL_BOD33_PSEL_DIV8K_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 8192 Position  */
#define SYSCTRL_BOD33_PSEL_DIV16K             (SYSCTRL_BOD33_PSEL_DIV16K_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 16384 Position  */
#define SYSCTRL_BOD33_PSEL_DIV32K             (SYSCTRL_BOD33_PSEL_DIV32K_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 32768 Position  */
#define SYSCTRL_BOD33_PSEL_DIV64K             (SYSCTRL_BOD33_PSEL_DIV64K_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 65536 Position  */
#define SYSCTRL_BOD33_LEVEL_Pos               _UINT32_(16)                                         /* (SYSCTRL_BOD33) BOD33 Threshold Level Position */
#define SYSCTRL_BOD33_LEVEL_Msk               (_UINT32_(0x3F) << SYSCTRL_BOD33_LEVEL_Pos)          /* (SYSCTRL_BOD33) BOD33 Threshold Level Mask */
#define SYSCTRL_BOD33_LEVEL(value)            (SYSCTRL_BOD33_LEVEL_Msk & (_UINT32_(value) << SYSCTRL_BOD33_LEVEL_Pos)) /* Assigment of value for LEVEL in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_Msk                     _UINT32_(0x003FF35E)                                 /* (SYSCTRL_BOD33) Register Mask  */


/* -------- SYSCTRL_VREG : (SYSCTRL Offset: 0x3C) (R/W 16) Voltage Regulator System (VREG) Control -------- */
#define SYSCTRL_VREG_RESETVALUE               _UINT16_(0x00)                                       /*  (SYSCTRL_VREG) Voltage Regulator System (VREG) Control  Reset Value */

#define SYSCTRL_VREG_RUNSTDBY_Pos             _UINT16_(6)                                          /* (SYSCTRL_VREG) Run in Standby Position */
#define SYSCTRL_VREG_RUNSTDBY_Msk             (_UINT16_(0x1) << SYSCTRL_VREG_RUNSTDBY_Pos)         /* (SYSCTRL_VREG) Run in Standby Mask */
#define SYSCTRL_VREG_RUNSTDBY(value)          (SYSCTRL_VREG_RUNSTDBY_Msk & (_UINT16_(value) << SYSCTRL_VREG_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SYSCTRL_VREG register */
#define SYSCTRL_VREG_FORCELDO_Pos             _UINT16_(13)                                         /* (SYSCTRL_VREG) Force LDO Voltage Regulator Position */
#define SYSCTRL_VREG_FORCELDO_Msk             (_UINT16_(0x1) << SYSCTRL_VREG_FORCELDO_Pos)         /* (SYSCTRL_VREG) Force LDO Voltage Regulator Mask */
#define SYSCTRL_VREG_FORCELDO(value)          (SYSCTRL_VREG_FORCELDO_Msk & (_UINT16_(value) << SYSCTRL_VREG_FORCELDO_Pos)) /* Assigment of value for FORCELDO in the SYSCTRL_VREG register */
#define SYSCTRL_VREG_Msk                      _UINT16_(0x2040)                                     /* (SYSCTRL_VREG) Register Mask  */


