MicrochipTech/oa-tc6-lib/examples/lwIP-SAM-D21-Curiosity-Nano/firmware/src/packs/ATSAMD21G17D_DFP/component/sysctrl.h
/* -------- SYSCTRL_VREF : (SYSCTRL Offset: 0x40) (R/W 32) Voltage References System (VREF) Control -------- */
#define SYSCTRL_VREF_RESETVALUE               _UINT32_(0x00)                                       /*  (SYSCTRL_VREF) Voltage References System (VREF) Control  Reset Value */

#define SYSCTRL_VREF_TSEN_Pos                 _UINT32_(1)                                          /* (SYSCTRL_VREF) Temperature Sensor Enable Position */
#define SYSCTRL_VREF_TSEN_Msk                 (_UINT32_(0x1) << SYSCTRL_VREF_TSEN_Pos)             /* (SYSCTRL_VREF) Temperature Sensor Enable Mask */
#define SYSCTRL_VREF_TSEN(value)              (SYSCTRL_VREF_TSEN_Msk & (_UINT32_(value) << SYSCTRL_VREF_TSEN_Pos)) /* Assigment of value for TSEN in the SYSCTRL_VREF register */
#define SYSCTRL_VREF_BGOUTEN_Pos              _UINT32_(2)                                          /* (SYSCTRL_VREF) Bandgap Output Enable Position */
#define SYSCTRL_VREF_BGOUTEN_Msk              (_UINT32_(0x1) << SYSCTRL_VREF_BGOUTEN_Pos)          /* (SYSCTRL_VREF) Bandgap Output Enable Mask */
#define SYSCTRL_VREF_BGOUTEN(value)           (SYSCTRL_VREF_BGOUTEN_Msk & (_UINT32_(value) << SYSCTRL_VREF_BGOUTEN_Pos)) /* Assigment of value for BGOUTEN in the SYSCTRL_VREF register */
#define SYSCTRL_VREF_CALIB_Pos                _UINT32_(16)                                         /* (SYSCTRL_VREF) Bandgap Voltage Generator Calibration Position */
#define SYSCTRL_VREF_CALIB_Msk                (_UINT32_(0x7FF) << SYSCTRL_VREF_CALIB_Pos)          /* (SYSCTRL_VREF) Bandgap Voltage Generator Calibration Mask */
#define SYSCTRL_VREF_CALIB(value)             (SYSCTRL_VREF_CALIB_Msk & (_UINT32_(value) << SYSCTRL_VREF_CALIB_Pos)) /* Assigment of value for CALIB in the SYSCTRL_VREF register */
#define SYSCTRL_VREF_Msk                      _UINT32_(0x07FF0006)                                 /* (SYSCTRL_VREF) Register Mask  */


/* -------- SYSCTRL_DPLLCTRLA : (SYSCTRL Offset: 0x44) (R/W 8) DPLL Control A -------- */
#define SYSCTRL_DPLLCTRLA_RESETVALUE          _UINT8_(0x80)                                        /*  (SYSCTRL_DPLLCTRLA) DPLL Control A  Reset Value */

#define SYSCTRL_DPLLCTRLA_ENABLE_Pos          _UINT8_(1)                                           /* (SYSCTRL_DPLLCTRLA) DPLL Enable Position */
#define SYSCTRL_DPLLCTRLA_ENABLE_Msk          (_UINT8_(0x1) << SYSCTRL_DPLLCTRLA_ENABLE_Pos)       /* (SYSCTRL_DPLLCTRLA) DPLL Enable Mask */
#define SYSCTRL_DPLLCTRLA_ENABLE(value)       (SYSCTRL_DPLLCTRLA_ENABLE_Msk & (_UINT8_(value) << SYSCTRL_DPLLCTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the SYSCTRL_DPLLCTRLA register */
#define SYSCTRL_DPLLCTRLA_RUNSTDBY_Pos        _UINT8_(6)                                           /* (SYSCTRL_DPLLCTRLA) Run in Standby Position */
#define SYSCTRL_DPLLCTRLA_RUNSTDBY_Msk        (_UINT8_(0x1) << SYSCTRL_DPLLCTRLA_RUNSTDBY_Pos)     /* (SYSCTRL_DPLLCTRLA) Run in Standby Mask */
#define SYSCTRL_DPLLCTRLA_RUNSTDBY(value)     (SYSCTRL_DPLLCTRLA_RUNSTDBY_Msk & (_UINT8_(value) << SYSCTRL_DPLLCTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SYSCTRL_DPLLCTRLA register */
#define SYSCTRL_DPLLCTRLA_ONDEMAND_Pos        _UINT8_(7)                                           /* (SYSCTRL_DPLLCTRLA) On Demand Clock Activation Position */
#define SYSCTRL_DPLLCTRLA_ONDEMAND_Msk        (_UINT8_(0x1) << SYSCTRL_DPLLCTRLA_ONDEMAND_Pos)     /* (SYSCTRL_DPLLCTRLA) On Demand Clock Activation Mask */
#define SYSCTRL_DPLLCTRLA_ONDEMAND(value)     (SYSCTRL_DPLLCTRLA_ONDEMAND_Msk & (_UINT8_(value) << SYSCTRL_DPLLCTRLA_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the SYSCTRL_DPLLCTRLA register */
#define SYSCTRL_DPLLCTRLA_Msk                 _UINT8_(0xC2)                                        /* (SYSCTRL_DPLLCTRLA) Register Mask  */


/* -------- SYSCTRL_DPLLRATIO : (SYSCTRL Offset: 0x48) (R/W 32) DPLL Ratio Control -------- */
#define SYSCTRL_DPLLRATIO_RESETVALUE          _UINT32_(0x00)                                       /*  (SYSCTRL_DPLLRATIO) DPLL Ratio Control  Reset Value */

#define SYSCTRL_DPLLRATIO_LDR_Pos             _UINT32_(0)                                          /* (SYSCTRL_DPLLRATIO) Loop Divider Ratio Position */
#define SYSCTRL_DPLLRATIO_LDR_Msk             (_UINT32_(0xFFF) << SYSCTRL_DPLLRATIO_LDR_Pos)       /* (SYSCTRL_DPLLRATIO) Loop Divider Ratio Mask */
#define SYSCTRL_DPLLRATIO_LDR(value)          (SYSCTRL_DPLLRATIO_LDR_Msk & (_UINT32_(value) << SYSCTRL_DPLLRATIO_LDR_Pos)) /* Assigment of value for LDR in the SYSCTRL_DPLLRATIO register */
#define SYSCTRL_DPLLRATIO_LDRFRAC_Pos         _UINT32_(16)                                         /* (SYSCTRL_DPLLRATIO) Loop Divider Ratio Fractional Part Position */
#define SYSCTRL_DPLLRATIO_LDRFRAC_Msk         (_UINT32_(0xF) << SYSCTRL_DPLLRATIO_LDRFRAC_Pos)     /* (SYSCTRL_DPLLRATIO) Loop Divider Ratio Fractional Part Mask */
#define SYSCTRL_DPLLRATIO_LDRFRAC(value)      (SYSCTRL_DPLLRATIO_LDRFRAC_Msk & (_UINT32_(value) << SYSCTRL_DPLLRATIO_LDRFRAC_Pos)) /* Assigment of value for LDRFRAC in the SYSCTRL_DPLLRATIO register */
#define SYSCTRL_DPLLRATIO_Msk                 _UINT32_(0x000F0FFF)                                 /* (SYSCTRL_DPLLRATIO) Register Mask  */


/* -------- SYSCTRL_DPLLCTRLB : (SYSCTRL Offset: 0x4C) (R/W 32) DPLL Control B -------- */
#define SYSCTRL_DPLLCTRLB_RESETVALUE          _UINT32_(0x00)                                       /*  (SYSCTRL_DPLLCTRLB) DPLL Control B  Reset Value */

#define SYSCTRL_DPLLCTRLB_FILTER_Pos          _UINT32_(0)                                          /* (SYSCTRL_DPLLCTRLB) Proportional Integral Filter Selection Position */
#define SYSCTRL_DPLLCTRLB_FILTER_Msk          (_UINT32_(0x3) << SYSCTRL_DPLLCTRLB_FILTER_Pos)      /* (SYSCTRL_DPLLCTRLB) Proportional Integral Filter Selection Mask */
#define SYSCTRL_DPLLCTRLB_FILTER(value)       (SYSCTRL_DPLLCTRLB_FILTER_Msk & (_UINT32_(value) << SYSCTRL_DPLLCTRLB_FILTER_Pos)) /* Assigment of value for FILTER in the SYSCTRL_DPLLCTRLB register */
#define   SYSCTRL_DPLLCTRLB_FILTER_DEFAULT_Val _UINT32_(0x0)                                        /* (SYSCTRL_DPLLCTRLB) Default filter mode  */
#define   SYSCTRL_DPLLCTRLB_FILTER_LBFILT_Val _UINT32_(0x1)                                        /* (SYSCTRL_DPLLCTRLB) Low bandwidth filter  */
#define   SYSCTRL_DPLLCTRLB_FILTER_HBFILT_Val _UINT32_(0x2)                                        /* (SYSCTRL_DPLLCTRLB) High bandwidth filter  */
#define   SYSCTRL_DPLLCTRLB_FILTER_HDFILT_Val _UINT32_(0x3)                                        /* (SYSCTRL_DPLLCTRLB) High damping filter  */
#define SYSCTRL_DPLLCTRLB_FILTER_DEFAULT      (SYSCTRL_DPLLCTRLB_FILTER_DEFAULT_Val << SYSCTRL_DPLLCTRLB_FILTER_Pos) /* (SYSCTRL_DPLLCTRLB) Default filter mode Position  */
#define SYSCTRL_DPLLCTRLB_FILTER_LBFILT       (SYSCTRL_DPLLCTRLB_FILTER_LBFILT_Val << SYSCTRL_DPLLCTRLB_FILTER_Pos) /* (SYSCTRL_DPLLCTRLB) Low bandwidth filter Position  */
#define SYSCTRL_DPLLCTRLB_FILTER_HBFILT       (SYSCTRL_DPLLCTRLB_FILTER_HBFILT_Val << SYSCTRL_DPLLCTRLB_FILTER_Pos) /* (SYSCTRL_DPLLCTRLB) High bandwidth filter Position  */
#define SYSCTRL_DPLLCTRLB_FILTER_HDFILT       (SYSCTRL_DPLLCTRLB_FILTER_HDFILT_Val << SYSCTRL_DPLLCTRLB_FILTER_Pos) /* (SYSCTRL_DPLLCTRLB) High damping filter Position  */
#define SYSCTRL_DPLLCTRLB_LPEN_Pos            _UINT32_(2)                                          /* (SYSCTRL_DPLLCTRLB) Low-Power Enable Position */
#define SYSCTRL_DPLLCTRLB_LPEN_Msk            (_UINT32_(0x1) << SYSCTRL_DPLLCTRLB_LPEN_Pos)        /* (SYSCTRL_DPLLCTRLB) Low-Power Enable Mask */
#define SYSCTRL_DPLLCTRLB_LPEN(value)         (SYSCTRL_DPLLCTRLB_LPEN_Msk & (_UINT32_(value) << SYSCTRL_DPLLCTRLB_LPEN_Pos)) /* Assigment of value for LPEN in the SYSCTRL_DPLLCTRLB register */
#define SYSCTRL_DPLLCTRLB_WUF_Pos             _UINT32_(3)                                          /* (SYSCTRL_DPLLCTRLB) Wake Up Fast Position */
#define SYSCTRL_DPLLCTRLB_WUF_Msk             (_UINT32_(0x1) << SYSCTRL_DPLLCTRLB_WUF_Pos)         /* (SYSCTRL_DPLLCTRLB) Wake Up Fast Mask */
#define SYSCTRL_DPLLCTRLB_WUF(value)          (SYSCTRL_DPLLCTRLB_WUF_Msk & (_UINT32_(value) << SYSCTRL_DPLLCTRLB_WUF_Pos)) /* Assigment of value for WUF in the SYSCTRL_DPLLCTRLB register */
#define SYSCTRL_DPLLCTRLB_REFCLK_Pos          _UINT32_(4)                                          /* (SYSCTRL_DPLLCTRLB) Reference Clock Selection Position */
#define SYSCTRL_DPLLCTRLB_REFCLK_Msk          (_UINT32_(0x3) << SYSCTRL_DPLLCTRLB_REFCLK_Pos)      /* (SYSCTRL_DPLLCTRLB) Reference Clock Selection Mask */
#define SYSCTRL_DPLLCTRLB_REFCLK(value)       (SYSCTRL_DPLLCTRLB_REFCLK_Msk & (_UINT32_(value) << SYSCTRL_DPLLCTRLB_REFCLK_Pos)) /* Assigment of value for REFCLK in the SYSCTRL_DPLLCTRLB register */
#define   SYSCTRL_DPLLCTRLB_REFCLK_REF0_Val   _UINT32_(0x0)                                        /* (SYSCTRL_DPLLCTRLB) CLK_DPLL_REF0 clock reference  */
#define   SYSCTRL_DPLLCTRLB_REFCLK_REF1_Val   _UINT32_(0x1)                                        /* (SYSCTRL_DPLLCTRLB) CLK_DPLL_REF1 clock reference  */
#define   SYSCTRL_DPLLCTRLB_REFCLK_GCLK_Val   _UINT32_(0x2)                                        /* (SYSCTRL_DPLLCTRLB) GCLK_DPLL clock reference  */
#define SYSCTRL_DPLLCTRLB_REFCLK_REF0         (SYSCTRL_DPLLCTRLB_REFCLK_REF0_Val << SYSCTRL_DPLLCTRLB_REFCLK_Pos) /* (SYSCTRL_DPLLCTRLB) CLK_DPLL_REF0 clock reference Position  */
#define SYSCTRL_DPLLCTRLB_REFCLK_REF1         (SYSCTRL_DPLLCTRLB_REFCLK_REF1_Val << SYSCTRL_DPLLCTRLB_REFCLK_Pos) /* (SYSCTRL_DPLLCTRLB) CLK_DPLL_REF1 clock reference Position  */
#define SYSCTRL_DPLLCTRLB_REFCLK_GCLK         (SYSCTRL_DPLLCTRLB_REFCLK_GCLK_Val << SYSCTRL_DPLLCTRLB_REFCLK_Pos) /* (SYSCTRL_DPLLCTRLB) GCLK_DPLL clock reference Position  */
#define SYSCTRL_DPLLCTRLB_LTIME_Pos           _UINT32_(8)                                          /* (SYSCTRL_DPLLCTRLB) Lock Time Position */
#define SYSCTRL_DPLLCTRLB_LTIME_Msk           (_UINT32_(0x7) << SYSCTRL_DPLLCTRLB_LTIME_Pos)       /* (SYSCTRL_DPLLCTRLB) Lock Time Mask */
#define SYSCTRL_DPLLCTRLB_LTIME(value)        (SYSCTRL_DPLLCTRLB_LTIME_Msk & (_UINT32_(value) << SYSCTRL_DPLLCTRLB_LTIME_Pos)) /* Assigment of value for LTIME in the SYSCTRL_DPLLCTRLB register */
#define   SYSCTRL_DPLLCTRLB_LTIME_DEFAULT_Val _UINT32_(0x0)                                        /* (SYSCTRL_DPLLCTRLB) No time-out  */
#define   SYSCTRL_DPLLCTRLB_LTIME_8MS_Val     _UINT32_(0x4)                                        /* (SYSCTRL_DPLLCTRLB) Time-out if no lock within 8 ms  */
#define   SYSCTRL_DPLLCTRLB_LTIME_9MS_Val     _UINT32_(0x5)                                        /* (SYSCTRL_DPLLCTRLB) Time-out if no lock within 9 ms  */
#define   SYSCTRL_DPLLCTRLB_LTIME_10MS_Val    _UINT32_(0x6)                                        /* (SYSCTRL_DPLLCTRLB) Time-out if no lock within 10 ms  */
#define   SYSCTRL_DPLLCTRLB_LTIME_11MS_Val    _UINT32_(0x7)                                        /* (SYSCTRL_DPLLCTRLB) Time-out if no lock within 11 ms  */
#define SYSCTRL_DPLLCTRLB_LTIME_DEFAULT       (SYSCTRL_DPLLCTRLB_LTIME_DEFAULT_Val << SYSCTRL_DPLLCTRLB_LTIME_Pos) /* (SYSCTRL_DPLLCTRLB) No time-out Position  */
#define SYSCTRL_DPLLCTRLB_LTIME_8MS           (SYSCTRL_DPLLCTRLB_LTIME_8MS_Val << SYSCTRL_DPLLCTRLB_LTIME_Pos) /* (SYSCTRL_DPLLCTRLB) Time-out if no lock within 8 ms Position  */
#define SYSCTRL_DPLLCTRLB_LTIME_9MS           (SYSCTRL_DPLLCTRLB_LTIME_9MS_Val << SYSCTRL_DPLLCTRLB_LTIME_Pos) /* (SYSCTRL_DPLLCTRLB) Time-out if no lock within 9 ms Position  */
#define SYSCTRL_DPLLCTRLB_LTIME_10MS          (SYSCTRL_DPLLCTRLB_LTIME_10MS_Val << SYSCTRL_DPLLCTRLB_LTIME_Pos) /* (SYSCTRL_DPLLCTRLB) Time-out if no lock within 10 ms Position  */
#define SYSCTRL_DPLLCTRLB_LTIME_11MS          (SYSCTRL_DPLLCTRLB_LTIME_11MS_Val << SYSCTRL_DPLLCTRLB_LTIME_Pos) /* (SYSCTRL_DPLLCTRLB) Time-out if no lock within 11 ms Position  */
#define SYSCTRL_DPLLCTRLB_LBYPASS_Pos         _UINT32_(12)                                         /* (SYSCTRL_DPLLCTRLB) Lock Bypass Position */
#define SYSCTRL_DPLLCTRLB_LBYPASS_Msk         (_UINT32_(0x1) << SYSCTRL_DPLLCTRLB_LBYPASS_Pos)     /* (SYSCTRL_DPLLCTRLB) Lock Bypass Mask */
#define SYSCTRL_DPLLCTRLB_LBYPASS(value)      (SYSCTRL_DPLLCTRLB_LBYPASS_Msk & (_UINT32_(value) << SYSCTRL_DPLLCTRLB_LBYPASS_Pos)) /* Assigment of value for LBYPASS in the SYSCTRL_DPLLCTRLB register */
#define SYSCTRL_DPLLCTRLB_DIV_Pos             _UINT32_(16)                                         /* (SYSCTRL_DPLLCTRLB) Clock Divider Position */
#define SYSCTRL_DPLLCTRLB_DIV_Msk             (_UINT32_(0x7FF) << SYSCTRL_DPLLCTRLB_DIV_Pos)       /* (SYSCTRL_DPLLCTRLB) Clock Divider Mask */
#define SYSCTRL_DPLLCTRLB_DIV(value)          (SYSCTRL_DPLLCTRLB_DIV_Msk & (_UINT32_(value) << SYSCTRL_DPLLCTRLB_DIV_Pos)) /* Assigment of value for DIV in the SYSCTRL_DPLLCTRLB register */
#define SYSCTRL_DPLLCTRLB_Msk                 _UINT32_(0x07FF173F)                                 /* (SYSCTRL_DPLLCTRLB) Register Mask  */


/* -------- SYSCTRL_DPLLSTATUS : (SYSCTRL Offset: 0x50) ( R/ 8) DPLL Status -------- */
#define SYSCTRL_DPLLSTATUS_RESETVALUE         _UINT8_(0x00)                                        /*  (SYSCTRL_DPLLSTATUS) DPLL Status  Reset Value */

